clarenceliu/Mplib/Toshaba/TMPM037/cmsis_lib/lib/src/tmpm037_uart.c
    tmp = UARTx->RFC;
    tmp &= RFC_4B_RIL_CLEAR;
    tmp |= RxFIFOLevel;
    UARTx->RFC = tmp;
}

/**
  * @brief  Select RX interrupt generation condition.
  * @param  UARTx: Select the UART channel.
  *   This parameter can be one of the following values:
  *   UART0,UART1,UART2,UART3,UART4.
  * @param  RxINTCondition: RX interrupt generation condition.
  *   This parameter can be: UART_RFIS_REACH_FLEVEL or UART_RFIS_REACH_EXCEED_FLEVEL.
  * @retval None
  */
void UART_RxFIFOINTSel(TSB_SC_TypeDef * UARTx, uint32_t RxINTCondition)
{
    uint32_t tmp = 0U;

    /* Check the parameters */
    assert_param(IS_UART_PERIPH(UARTx));
    assert_param(IS_UATR_RFIS_CONDITION(RxINTCondition));

    tmp = UARTx->RFC;
    tmp &= RFC_RFIS_CLEAR;
    tmp |= RxINTCondition;
    UARTx->RFC = tmp;
}

/**
  * @brief  Receive FIFO clear.
  * @param  UARTx: Select the UART channel.
  *   This parameter can be one of the following values:
  *   UART0,UART1,UART2,UART3,UART4.
  * @retval None
  */
void UART_RxFIFOClear(TSB_SC_TypeDef * UARTx)
{
    uint32_t tmp = 0U;
    /* Check the parameters */
    assert_param(IS_UART_PERIPH(UARTx));

    tmp = UARTx->RFC;
    tmp |= TRFC_TRFCS_SET;
    UARTx->RFC = tmp;
}

/**
  * @brief  Transmit FIFO fill level to generate transmit interrupts.
  * @param  UARTx: Select the UART channel.
  *   This parameter can be one of the following values:
  *   UART0,UART1,UART2,UART3,UART4.
  * @param  TxFIFOLevel: Transmit FIFO fill level.
  *   This parameter can be one of the following values:
  *   UART_TXFIFO4B_FLEVLE_0_0B, UART_TXFIFO4B_FLEVLE_1_1B,
  *   UART_TXFIFO4B_FLEVLE_2_0B or UART_TXFIFO4B_FLEVLE_3_1B.
  * @retval None
  */
void UART_TxFIFOFillLevel(TSB_SC_TypeDef * UARTx, uint32_t TxFIFOLevel)
{
    uint32_t tmp = 0U;

    /* Check the parameters */
    assert_param(IS_UART_PERIPH(UARTx));
    assert_param(IS_UART_TXFIFO4B_FLEVLE(TxFIFOLevel));


    tmp = UARTx->TFC;
    tmp &= TFC_4B_TIL_CLEAR;
    tmp |= TxFIFOLevel;
    UARTx->TFC = tmp;
}

/**
  * @brief  Select TX interrupt generation condition.
  * @param  UARTx: Select the UART channel.
  *   This parameter can be one of the following values:
  *   UART0,UART1,UART2,UART3,UART4.
  * @param  TxINTCondition: TX interrupt generation condition.
  *   This parameter can be: UART_TFIS_REACH_FLEVEL or UART_TFIS_REACH_NOREACH_FLEVEL.
  * @retval None
  */
void UART_TxFIFOINTSel(TSB_SC_TypeDef * UARTx, uint32_t TxINTCondition)
{
    uint32_t tmp = 0U;

    /* Check the parameters */
    assert_param(IS_UART_PERIPH(UARTx));
    assert_param(IS_UATR_TFIS_CONDITION(TxINTCondition));

    tmp = UARTx->TFC;
    tmp &= TFC_TFIS_CLEAR;
    tmp |= TxINTCondition;
    UARTx->TFC = tmp;
}

/**
  * @brief  Transmit FIFO clear.
  * @param  UARTx: Select the UART channel.
  *   This parameter can be one of the following values:
  *   UART0,UART1,UART2,UART3,UART4.
  * @retval None
  */
void UART_TxFIFOClear(TSB_SC_TypeDef * UARTx)
{
    uint32_t tmp = 0U;
    /* Check the parameters */
    assert_param(IS_UART_PERIPH(UARTx));

    tmp = UARTx->TFC;
    tmp |= TRFC_TRFCS_SET;
    UARTx->TFC = tmp;
}

/**
  * @brief  Transmit buffer clear.
  * @param  UARTx: Select the UART channel.
  *   This parameter can be one of the following values:
  *   UART0,UART1,UART2,UART3,UART4.
  * @retval None
  */
void UART_TxBufferClear(TSB_SC_TypeDef * UARTx)
{
    uint32_t tmp = 0U;
    /* Check the parameters */
    assert_param(IS_UART_PERIPH(UARTx));

    tmp = UARTx->TFC;
    tmp |= TFC_TBCLR_SET;
    UARTx->TFC = tmp;
}

/**
  * @brief  Status of receive FIFO fill level.
  * @param  UARTx: Select the UART channel.
  *   This parameter can be one of the following values:
  *   UART0,UART1,UART2,UART3,UART4.
  * @retval Receive FIFO fill level status.
  */
uint32_t UART_GetRxFIFOFillLevelStatus(TSB_SC_TypeDef * UARTx)
{
    uint32_t tmp = 0U;
    /* Check the parameters */
    assert_param(IS_UART_PERIPH(UARTx));

    tmp = UARTx->RST;
    tmp &= TRXST_4B_TRLVL_MASK;
    /* Return the value */
    return tmp;
}

/**
  * @brief  Receive FIFO overrun.
  * @param  UARTx: Select the UART channel.
  *   This parameter can be one of the following values:
  *   UART0,UART1,UART2,UART3,UART4.
  * @retval Receive FIFO overrun status.
  */
uint32_t UART_GetRxFIFOOverRunStatus(TSB_SC_TypeDef * UARTx)
{
    uint32_t tmp = 0U;
    uint32_t regval = 0U;
    /* Check the parameters */
    assert_param(IS_UART_PERIPH(UARTx));

    tmp = UARTx->RST;
    if ((tmp & TRXST_TUR_ROR_MASK) == TRXST_TUR_ROR_MASK) {
        regval = UART_RXFIFO_OVERRUN;
    } else {
        /* Do nothing */
    }
    /* Return the value */
    return regval;
}

/**
  * @brief  Status of transmit FIFO fill level.
  * @param  UARTx: Select the UART channel.
  *   This parameter can be one of the following values:
  *   UART0,UART1,UART2,UART3,UART4.
  * @retval Transmit FIFO fill level status.
  */
uint32_t UART_GetTxFIFOFillLevelStatus(TSB_SC_TypeDef * UARTx)
{
    uint32_t tmp = 0U;
    /* Check the parameters */
    assert_param(IS_UART_PERIPH(UARTx));

    tmp = UARTx->TST;
    tmp &= TRXST_4B_TRLVL_MASK;
    /* Return the value */
    return tmp;
}

/**
  * @brief  Transmit FIFO under run.
  * @param  UARTx: Select the UART channel.
  *   This parameter can be one of the following values:
  *   UART0,UART1,UART2,UART3,UART4.
  * @retval Transmit FIFO under run status.
  */
uint32_t UART_GetTxFIFOUnderRunStatus(TSB_SC_TypeDef * UARTx)
{
    uint32_t tmp = 0U;
    uint32_t regval = 0U;
    /* Check the parameters */
    assert_param(IS_UART_PERIPH(UARTx));

    tmp = UARTx->TST;
    if ((tmp & TRXST_TUR_ROR_MASK) == TRXST_TUR_ROR_MASK) {
        regval = UART_TXFIFO_UNDERRUN;
    } else {
        /* Do nothing */
    }
    /* Return the value */
    return regval;
}

/**
  * @brief  Enable or disable the specified UART channel DMA Request By 
      receive interrupt INTRX
  * @param  UARTx: Select the UART channel.
  *   This parameter can be one of the following values:
  *   UART0,UART1,UART2,UART3,UART4.
  * @param  NewState: New state of the UART channel in IDLE.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void UART_SetRxDMAReq(TSB_SC_TypeDef * UARTx, FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_UART_PERIPH(UARTx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState == ENABLE) {
        /* Set SCxDMA<DMAEN1> to enable UARTx DMA Request */
        UARTx->DMA |= DMA_EN1_SET;
    } else {
        /* Clear SCxDMA<DMAEN1> to disable UARTx DMA Request */
        UARTx->DMA &= DMA_EN1_CLEAR;
    }
}

/**
  * @brief  Enable or disable the specified UART channel DMA Request By 
      receive interrupt INTTX
  * @param  UARTx: Select the UART channel.
  *   This parameter can be one of the following values:
  *   UART0,UART1,UART2,UART3,UART4.
  * @param  NewState: New state of the UART channel in IDLE.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void UART_SetTxDMAReq(TSB_SC_TypeDef * UARTx, FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_UART_PERIPH(UARTx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState == ENABLE) {
        /* Set SCxDMA<DMAEN0> to enable UARTx DMA Request */
        UARTx->DMA |= DMA_EN0_SET;
    } else {
        /* Clear SCxDMA<DMAEN0> to disable UARTx DMA Request */
        UARTx->DMA &= DMA_EN0_CLEAR;
    }
}

/**
  * @brief  Selects input clock for prescaler.
  * @param  SIOx: Select the SIO channel.
  *   This parameter can be one of the following values:
  *   SIO0,SIO1,SIO2,SIO3,SIO4.
  * @param  clock: Selects input clock for prescaler as PhiT0/2 or PhiT0.
  *   This parameter can be: 
  *   SIO_CLOCK_T0_HALF (PhiT0/2)or SIO_CLOCK_T0(PhiT0)
  * @retval None
  * @note SIO_SetInputClock need to use before SIO_Init.
  */
void SIO_SetInputClock(TSB_SC_TypeDef * SIOx, uint32_t Clock)
{
    uint32_t tmp = 0U;
    assert_param(IS_SIO_PERIPH(SIOx));
    assert_param(IS_SIO_CLOCK(Clock));

    tmp = SIOx->EN;
    tmp &= EN_BRCKSEL_MASK;
    tmp |= Clock;
    SIOx->EN = tmp;
}

/**
  * @brief  Enable the specified SIO channel.
  * @param  SIOx: Select the SIO channel.
  *   This parameter can be one of the following values:
  *   SIO0,SIO1,SIO2,SIO3,SIO4.
  * @retval None
  */
void SIO_Enable(TSB_SC_TypeDef * SIOx)
{
    /* Check the parameters */
    assert_param(IS_SIO_PERIPH(SIOx));
    /* Set SCxEN<SIOE> to enable SIOx */
    SIOx->EN |= EN_SIOE_SET;
}

/**
  * @brief  Disable the specified SIO channel.
  * @param  SIOx: Select the SIO channel.
  *   This parameter can be one of the following values:
  *   SIO0,SIO1,SIO2,SIO3,SIO4.
  * @retval None
  */
void SIO_Disable(TSB_SC_TypeDef * SIOx)
{
    /* Check the parameters */
    assert_param(IS_SIO_PERIPH(SIOx));
    /* Clear SCxEN<SIOE> to disable SIOx */
    SIOx->EN &= EN_SIOE_CLEAR;
}

/**
  * @brief  Get received data of the specified SIO channel.
  * @param  SIOx: Select the SIO channel.
  *   This parameter can be one of the following values:
  *   SIO0,SIO1,SIO2,SIO3,SIO4.
  * @retval The received data
  */
uint8_t SIO_GetRxData(TSB_SC_TypeDef * SIOx)
{
    uint8_t retval = 0U;
    /* Check the parameters */
    assert_param(IS_SIO_PERIPH(SIOx));

    /* Return received data */
    retval = (uint8_t) SIOx->BUF;

    return retval;
}

/**
  * @brief  Set data to be sent and start transmitting via the specified
      SIO channel.
  * @param  SIOx: Select the SIO channel.
  *   This parameter can be one of the following values:
  *   SIO0,SIO1,SIO2,SIO3,SIO4.
  * @param  Data: the data to be sent.
  * @retval None
  */
void SIO_SetTxData(TSB_SC_TypeDef * SIOx, uint8_t Data)
{
    /* Check the parameters */
    assert_param(IS_SIO_PERIPH(SIOx));

